In [2]:
import pandas as pd
data = {
    'age' : [23,43,12,45],
    'name' : ['민준', '현우', '서연', '동현'],
    'height' : [175.4, 180.3, 165.2, 172.7]
}

x = pd.DataFrame(data, columns=['name', 'age', 'height'])
x

  name  age  height
0   민준   23   175.4
1   현우   43   180.3
2   서연   12   165.2
3   동현   45   172.7

In [7]:
ary = [[1,2],[3,4],[5,6]]
data = pd.DataFrame(ary, columns=['first', 'second'], index=['철수', '영희', '수영'])
data

    first  second
철수      1       2
영희      3       4
수영      5       6

In [8]:
data.iloc[1]

first     3
second    4
Name: 영희, dtype: int64

In [11]:
data.iloc[1,-1]
data.iloc[1,:]

first     3
second    4
Name: 영희, dtype: int64

In [12]:
df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
     index=['cobra', 'viper', 'sidewinder'],
     columns=['max_speed', 'shield'])

In [13]:
df.loc['viper']

max_speed    4
shield       5
Name: viper, dtype: int64

In [14]:
df.loc[['viper', 'sidewinder']]

            max_speed  shield
viper               4       5
sidewinder          7       8